# Specify completions we want before the completion module is loaded
zsh-users/zsh-completions kind:fpath path:src

mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/directory
mattmc3/zephyr path:plugins/editor
mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
mattmc3/zephyr path:plugins/homebrew
mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/utility

# Load compstyle/completion last
mattmc3/zephyr path:plugins/compstyle
mattmc3/zephyr path:plugins/completion

# Load gitstatus for our prompt
romkatv/gitstatus
